Oleh-Dubrovskyi/STM32Projects/STM32_F401_HC-SR04_LCD1602_I2C/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
#include "../../DelayMicro/Inc/delay_micro.h"
#include "../../Hc_Sr04/Inc/hc_sr04.h"
#include "../../Lcd1602_i2c/Inc/lcd1602_i2c.h"
#include "../../Leds_control/Inc/leds_control.h"
#include "stm32f4xx_hal.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
uint32_t distance  = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// Display 2 messages on LCD1602
static void DisplayMessagesOnLCD1602(uint8_t position1, char * message1, uint8_t position2, char * message2)
{
    Lcd1602ScreenClear();
    Lcd1602SetCursor(0, position1);
    Lcd1602WriteString(message1);
    Lcd1602SetCursor(1, position2);
    Lcd1602WriteString(message2);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
    // Initialize TIM2 to use for micro-delays
    TIM2MicrosecondsDelayInit();
    // Set TIM handle pointer
    HcSr04SetTimHandlePointer(&htim2);
    // Set GPIO for the HC-SR04 trigger pin
    HC_SR04_GpioItem trigger_gpio_item = {.gpio_type = GPIOA, .gpio_pin = GPIO_PIN_9};
    HcSr04SetGpioTrigger(trigger_gpio_item);
    // Set GPIO for the HC-SR04 echo pin
    HC_SR04_GpioItem echo_gpio_item = {.gpio_type = GPIOA, .gpio_pin = GPIO_PIN_8};
    HcSr04SetGpioEcho(echo_gpio_item);

    // Configure GPIO for red, yellow and green external LEDs
    LedGpioControlLine red_led = {.gpio_type = GPIOB, .gpio_pin = GPIO_PIN_4};
    LedGpioControlLine yellow_led = {.gpio_type = GPIOB, .gpio_pin = GPIO_PIN_5};
    LedGpioControlLine green_led = {.gpio_type = GPIOB, .gpio_pin = GPIO_PIN_6};
    LedsControlConfigureLedsGPIOs(red_led, yellow_led, green_led);
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM2_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
    // Initiate the trigger pin of the Ultrasonic Ranging Module
    HAL_GPIO_WritePin(trigger_gpio_item.gpio_type, trigger_gpio_item.gpio_pin, GPIO_PIN_RESET);

    // Set LCD1602 Interface type into I2C
    Lcd1602SetInterfaceType(LCD1602_I2C);

    // Set the LCD1602 Display's communication data bus into I2C mode
	GpioItem lcd1602_gpio_data_bus[] =
	{
        {GPIOB, GPIO_PIN_8},  // SCL
        {GPIOB, GPIO_PIN_9},  // SDA
        UNDEFINED_GPIO,
        UNDEFINED_GPIO,
        UNDEFINED_GPIO,
        UNDEFINED_GPIO,
        UNDEFINED_GPIO,
        UNDEFINED_GPIO
    };
    Lcd1602ConfigureI2C(lcd1602_gpio_data_bus);

    // Prepare the initial messages for the LCD1602 Display
    char message1[100];
    char message2[100];
    strcpy(message1,  " *** STM32 ***  ");
    strcpy(message2, "HCSR04 connected");

    // Display the initial messages on LCD1602 for 3 seconds
    DisplayMessagesOnLCD1602(1, message1, 0, message2);
    TIM2MillisecondsDelay(3000);

    /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
    strcpy(message1,  "*** HC-SR04 ***");
    char distance_str[16];
    while (1)
    {
        // Request the Ultrasonic Ranging Module to evaluate the distance to the object
    	HcSr04Triggert10usHighLevelSignal();
        // Get the distance
    	int8_t result = HcSr04ReadDistance(&distance);
        // Parse the result
    	if (!result)
    	{
            // The echo pulse signal was received by the Ultrasonic Ranging Module in time
    		// Set LEDs' status on distance
    		LedsControlSetLedsOnDistance(distance);
    		// Show the distance on LCD1602
    		sprintf(distance_str, "L = %lu cm", distance);
    	    DisplayMessagesOnLCD1602(0, message1, 3, distance_str);
    	}
    	else if (result > 0)
    	{
            // The distance between the Ultrasonic Ranging Module and the object can not be defined (> MAX_RANGE)
    		// Set LED status according to distance from object
    		LedsControlSetLedsOnDistance(SAFE_DISTANCE);
    		// Show that the distance is greater than Max Range of HC-SR04 on LCD1602
    		sprintf(distance_str, "L > %u cm", MAX_RANGE);
            DisplayMessagesOnLCD1602(0, message1, 3, distance_str);
    	}
    	else if ((result < 0) && (distance == 1))
    	{
            // The distance between the Ultrasonic Ranging Module and the object can not be defined (< MIN_RANGE)
    		// Set LEDs' status according with dangerous distance from object
    		LedsControlSetLedsOnDistance(DANGEROUS_DISTANCE);
    		// Show the distance is less than Min Range of HC-SR04 on LCD1602
    		sprintf(distance_str, "L < %u cm", MIN_RANGE);
    		DisplayMessagesOnLCD1602(0, message1, 4, distance_str);
    	}
    	else if (result < 0)
    	{
    	    // Ultrasonic Ranging Module did not respond
    		// Set LEDs' status according with dangerous distance from object
    		LedsControlSetLedsOnDistance(DANGEROUS_DISTANCE);
    		// Show the Ultrasonic Ranging Module HC-SR04 did not respond
    		sprintf(distance_str, "Did not respond");
    		DisplayMessagesOnLCD1602(0, message1, 4, distance_str);
    	}
    	TIM2MillisecondsDelay(500);
    	// Switch LEDs' OFF
    	LedsControlSwitchLedsOff();
    	TIM2MillisecondsDelay(500);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 100000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
  * @brief TIM2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM2_Init(void)
{

  /* USER CODE BEGIN TIM2_Init 0 */

  /* USER CODE END TIM2_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM2_Init 1 */

  /* USER CODE END TIM2_Init 1 */
  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 15;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 65535;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM2_Init 2 */

  /* USER CODE END TIM2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_9, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6, GPIO_PIN_RESET);

  /*Configure GPIO pins : PA0 PA6 PA7 PA9 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : PA8 */
  GPIO_InitStruct.Pin = GPIO_PIN_8;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PB4 PB5 PB6 */
  GPIO_InitStruct.Pin = GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
